# Terminal

## Stow
brew 'stow'

## Git
brew 'git'
brew 'gh'
brew 'lazygit'
brew 'git-delta'

## Terminal IDE
brew 'neovim'
brew 'tmux'
brew 'tmuxinator'

## CLI
brew 'zsh'
brew 'zplug'
brew 'starship'
brew 'bat'
brew 'bat-extras'
brew 'ripgrep'
brew 'zoxide'
brew 'lsd'
brew 'fd'
brew 'asciinema'
brew 'awscli'
brew 'mongosh'
brew 'hyperfine

## Node.js
brew 'node'
brew 'deno'
brew 'pnpm'

## Tools
cask 'docker'
brew 'lazydocker'
brew 'postgresql'
brew 'lynx'

## Fonts
cask font-jetbrains-mono

# Apps

## 1Password
cask '1password'
cask '1password-cli'

## Development
cask 'ghostty'
cask 'visual-studio-code'
cask 'zed'
cask 'cursor'
cask 'mongodb-compass'
cask 'pgadmin4'

## Utilities
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'raycast'
cask 'rectangle'
cask 'screen-studio'

## Communication
cask 'whatsapp'
cask 'zoom'
cask 'slack'
cask 'loom'

## Browsers
cask 'arc'
cask 'firefox'
cask 'google-chrome'

# Media
cask 'spotify'
